In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn
from numpy.random import randint
np.random.seed(101)

In [6]:
df=pd.DataFrame(randint(50,100, size=(5,4)), index='A B C D E'.split(),columns='W X Y Z'.split())

In [7]:
df=pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())

In [8]:
df

          W         X         Y         Z
A -1.331713  2.084437  1.753258 -0.060464
B  0.707670 -1.084355  0.941276  1.301172
C -0.152315  0.143770  0.392448  0.321788
D  1.029048 -0.272079  2.060797 -1.046867
E -2.273739  1.218096 -0.662684  0.420491

add new row

In [9]:
new_row={'W':'0.123','X':'0.234','Y':'0.431','Z':'1.786'}

adding row

In [10]:
df=df.append(new_row, ignore_index=True)

C:\Users\Kazi Swati\AppData\Local\Temp\ipykernel_13820\4057965891.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(new_row, ignore_index=True)

In [11]:
df

          W         X         Y         Z
0 -1.331713  2.084437  1.753258 -0.060464
1   0.70767 -1.084355  0.941276  1.301172
2 -0.152315   0.14377  0.392448  0.321788
3  1.029048 -0.272079  2.060797 -1.046867
4 -2.273739  1.218096 -0.662684  0.420491
5     0.123     0.234     0.431     1.786

drop row

In [12]:
df

          W         X         Y         Z
0 -1.331713  2.084437  1.753258 -0.060464
1   0.70767 -1.084355  0.941276  1.301172
2 -0.152315   0.14377  0.392448  0.321788
3  1.029048 -0.272079  2.060797 -1.046867
4 -2.273739  1.218096 -0.662684  0.420491
5     0.123     0.234     0.431     1.786

In [13]:
df.drop(5,axis=0)

          W         X         Y         Z
0 -1.331713  2.084437  1.753258 -0.060464
1   0.70767 -1.084355  0.941276  1.301172
2 -0.152315   0.14377  0.392448  0.321788
3  1.029048 -0.272079  2.060797 -1.046867
4 -2.273739  1.218096 -0.662684  0.420491

In [14]:
df

          W         X         Y         Z
0 -1.331713  2.084437  1.753258 -0.060464
1   0.70767 -1.084355  0.941276  1.301172
2 -0.152315   0.14377  0.392448  0.321788
3  1.029048 -0.272079  2.060797 -1.046867
4 -2.273739  1.218096 -0.662684  0.420491
5     0.123     0.234     0.431     1.786

In [15]:
df.drop(5,axis=0, inplace=True)

In [16]:
df

          W         X         Y         Z
0 -1.331713  2.084437  1.753258 -0.060464
1   0.70767 -1.084355  0.941276  1.301172
2 -0.152315   0.14377  0.392448  0.321788
3  1.029048 -0.272079  2.060797 -1.046867
4 -2.273739  1.218096 -0.662684  0.420491

Select rows

In [19]:
#df.loc['A']#rowname = A, ekhane nai that why num lagbe
df.iloc[3]#index location

W    1.029048
X   -0.272079
Y    2.060797
Z   -1.046867
Name: 3, dtype: object

column

In [21]:
df['W'] #select col

0   -1.331713
1     0.70767
2   -0.152315
3    1.029048
4   -2.273739
Name: W, dtype: object

In [23]:
df[['W','X','Z']] #select multiple col

          W         X         Z
0 -1.331713  2.084437 -0.060464
1   0.70767 -1.084355  1.301172
2 -0.152315   0.14377  0.321788
3  1.029048 -0.272079 -1.046867
4 -2.273739  1.218096  0.420491

In [25]:
type(df['W']) #type of col

pandas.core.series.Series

In [26]:
df['new']=df['W']+df['X'] #add col

In [27]:
df

          W         X         Y         Z       new
0 -1.331713  2.084437  1.753258 -0.060464  0.752724
1   0.70767 -1.084355  0.941276  1.301172 -0.376685
2 -0.152315   0.14377  0.392448  0.321788 -0.008545
3  1.029048 -0.272079  2.060797 -1.046867   0.75697
4 -2.273739  1.218096 -0.662684  0.420491 -1.055642

In [28]:
df.drop('new', axis=1)

          W         X         Y         Z
0 -1.331713  2.084437  1.753258 -0.060464
1   0.70767 -1.084355  0.941276  1.301172
2 -0.152315   0.14377  0.392448  0.321788
3  1.029048 -0.272079  2.060797 -1.046867
4 -2.273739  1.218096 -0.662684  0.420491

In [29]:
df

          W         X         Y         Z       new
0 -1.331713  2.084437  1.753258 -0.060464  0.752724
1   0.70767 -1.084355  0.941276  1.301172 -0.376685
2 -0.152315   0.14377  0.392448  0.321788 -0.008545
3  1.029048 -0.272079  2.060797 -1.046867   0.75697
4 -2.273739  1.218096 -0.662684  0.420491 -1.055642

In [32]:
df.drop('X',axis=1, inplace=True)

In [33]:
df

          W         Y         Z
0 -1.331713  1.753258 -0.060464
1   0.70767  0.941276  1.301172
2 -0.152315  0.392448  0.321788
3  1.029048  2.060797 -1.046867
4 -2.273739 -0.662684  0.420491

select specific row & col

In [35]:
df.iloc[[1,2],[1,2]]

          Y         Z
1  0.941276  1.301172
2  0.392448  0.321788

In [36]:
df.loc[[1,2],['W','Z']]

          W         Z
1   0.70767  1.301172
2 -0.152315  0.321788

In [37]:
df.loc[[1,3],['Y','Z']]

          Y         Z
1  0.941276  1.301172
3  2.060797 -1.046867

In [38]:
df.loc[[1,3],['Y','Z']].shape #shape nite
#df2=uporer
#df2.shape[0]->row, df2[1].shape[1]-> col

(2, 2)

# Conditional Selection

an importatnt fearture of pandas is conditional selection using bracket notation, very similar to numpy

In [39]:
df

          W         Y         Z
0 -1.331713  1.753258 -0.060464
1   0.70767  0.941276  1.301172
2 -0.152315  0.392448  0.321788
3  1.029048  2.060797 -1.046867
4 -2.273739 -0.662684  0.420491

In [40]:
df>0

       W      Y      Z
0  False   True  False
1   True   True   True
2  False   True   True
3   True   True  False
4  False  False   True

In [41]:
df[df>0] #true val gulo thakbe, false gulo NaN

          W         Y         Z
0       NaN  1.753258       NaN
1   0.70767  0.941276  1.301172
2       NaN  0.392448  0.321788
3  1.029048  2.060797       NaN
4       NaN       NaN  0.420491

In [46]:
df[df['W']>0] #col er ekta (ekhane 0) val er beshi number thakbe only

          W         Y         Z
1   0.70767  0.941276  1.301172
3  1.029048  2.060797 -1.046867

for two condition you can use | and & with parenthesis

In [47]:
df[(df['W']>0)&(df['Y']<1)]

         W         Y         Z
1  0.70767  0.941276  1.301172

In [49]:
df[df['W']>0][['Y','Z']] #'W' er je val 0 theke boro, tader corresponding y ar z er value

          Y         Z
1  0.941276  1.301172
3  2.060797 -1.046867

In [50]:
df

          W         Y         Z
0 -1.331713  1.753258 -0.060464
1   0.70767  0.941276  1.301172
2 -0.152315  0.392448  0.321788
3  1.029048  2.060797 -1.046867
4 -2.273739 -0.662684  0.420491

In [47]:
df

    W   X   Y   Z
A  79  74  86  69
B  85  80  60  89
C  70  77  58  72
D  76  73  96  97
E  87  72  59  95

# More Index details

lets discuss some more feature of indexing, resetting the index, index hierarchy

In [51]:
df

          W         Y         Z
0 -1.331713  1.753258 -0.060464
1   0.70767  0.941276  1.301172
2 -0.152315  0.392448  0.321788
3  1.029048  2.060797 -1.046867
4 -2.273739 -0.662684  0.420491

In [52]:
df.reset_index() #reset to default index 1,2,3,4...

   index         W         Y         Z
0      0 -1.331713  1.753258 -0.060464
1      1   0.70767  0.941276  1.301172
2      2 -0.152315  0.392448  0.321788
3      3  1.029048  2.060797 -1.046867
4      4 -2.273739 -0.662684  0.420491

In [53]:
newind='Ca ba ga ta da'.split()

In [54]:
df['states']=newind

In [55]:
df

          W         Y         Z states
0 -1.331713  1.753258 -0.060464     Ca
1   0.70767  0.941276  1.301172     ba
2 -0.152315  0.392448  0.321788     ga
3  1.029048  2.060797 -1.046867     ta
4 -2.273739 -0.662684  0.420491     da

In [56]:
df.set_index('states')

               W         Y         Z
states
Ca     -1.331713  1.753258 -0.060464
ba       0.70767  0.941276  1.301172
ga     -0.152315  0.392448  0.321788
ta      1.029048  2.060797 -1.046867
da     -2.273739 -0.662684  0.420491

# Multi-index & index hierarchy

In [57]:
#index level
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [58]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [60]:
df=pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B'])

In [61]:
df

             A         B
G1 1  0.050221  1.556790
   2  1.345434  1.501737
   3 -0.633348 -0.487281
G2 1 -1.647469  0.543758
   2 -1.210949 -0.365949
   3  0.632181 -0.393214

Now lets show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use nromal bracket notation df[]. calling one level of the index returns the sub-dataframe

In [62]:
df.loc['G1']

          A         B
1  0.050221  1.556790
2  1.345434  1.501737
3 -0.633348 -0.487281

In [63]:
df.loc['G1'].loc[1]

A    0.050221
B    1.556790
Name: 1, dtype: float64

In [64]:
df.loc['G2'].loc[2]

A   -1.210949
B   -0.365949
Name: 2, dtype: float64

In [65]:
df.index.names #initially no name provided

FrozenList([None, None])

In [66]:
df.index.names=['Group', 'Num'] #name assigned

In [67]:
df.index.names

FrozenList(['Group', 'Num'])

In [68]:
df

                  A         B
Group Num
G1    1    0.050221  1.556790
      2    1.345434  1.501737
      3   -0.633348 -0.487281
G2    1   -1.647469  0.543758
      2   -1.210949 -0.365949
      3    0.632181 -0.393214

In [70]:
df.xs('G1') #you can access 'G1' without using loc

            A         B
Num
1    0.050221  1.556790
2    1.345434  1.501737
3   -0.633348 -0.487281

In [71]:
df.xs(['G1',1])

C:\Users\Kazi Swati\AppData\Local\Temp\ipykernel_13820\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    0.050221
B    1.556790
Name: (G1, 1), dtype: float64

In [72]:
df.loc['G1'].loc[1] #same as above

A    0.050221
B    1.556790
Name: 1, dtype: float64

In [76]:
df.xs(1,  level='Num') #show rows where level 'Num' = 1

              A         B
Group
G1     0.050221  1.556790
G2    -1.647469  0.543758